"""
Создайте переменные типа str в которых будут перечислены разные продукты питания,
складывая строки сделайте фразу в которой будут перечисляться все продукты.
Например “I have: chocolate_bar, coffee, tea”
"""

food_item_1 = "Frozen Pizza"
food_item_2 = "Cold Diet Coke"
food_item_3 = "M&Ms"

print("I always have in my fridge: \n{}, {}, {}.".format(food_item_1, food_item_2, food_item_3))