"""
Дан список: ['Ivan', 'Ivanou'], и 2 строки: Minsk, Belarus Напечатайте текст:
"Привет, Ivan Ivanou! Добро пожаловать в Minsk Belarus"
"""

my_list = ['Ivan', 'Ivanou']
first_name = my_list[0]
last_name = my_list[1]
city = "Minsk"
country = "Belarus"

print(f"Привет, {first_name} {last_name}! Добро пожаловать в {city}, {country}")
