### Задание A
print("Задание A")
a = 10
b = 12.5
c = "Milk"
d = [1, 2, 3]

print(type(a))
print(type(b))
print(type(c))
print(type(d))

### Задание B
print("Задание B")
def task(a, b):
    print (a+b)
    print (b-a)
    print (a+b*a)
    print (a+b/a)
    print (a**3)
    print (b+a**2)
task(8, 13.2)

### Задание C (Вариант 1)
print("Задание C (Вариант 1)")
Coffee = 15
Milk = 7
Bread = 5
Cheese = 13
print(Coffee+Milk+Bread+Cheese)

### Задание C (Вариант 2)
print("Задание C (Вариант 2)")
e = "Coffee, "
f = "Milk, "
g = "bread, "
h = "Cheese"

print (e, f, g, h)

def price(e, f, g, h):
    print(e+f+g+h) 
price(15, 7, 5, 13)

### Задание D
print("Задание D")
var_1 = 25
var_2 = var_1 + 3
var_3 = var_1 + var_2
print(var_1, var_2, var_3)

### Задание E
print("Задание E")
print("I have: "+e+f+g+h) ###Переменные взяты из Задания C (Вариант 2)